load-test.yml
config:
  target: 'http://localhost:8000'
  http:
    pool: 10
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 20
      name: "Warm up"
    - duration: 30
      arrivalRate: 20
      name: "Mid load"
    - duration: 60
      arrivalRate: 100
      name: "Max load"
  payload:
    path: "IDs.csv"
    fields:
      - "id"
    skipheader: true
scenarios:
  - name: "Get and Post request"
    flow:
        - get:
            url: "/books/{{ id }}"
        - post:
            url: "/books"
            json:
              bookid: 108760033
              type: "audio"
              pagenum: 233
              publisher: "Stardust Inc"
              dates: "May 18, 2018"
              title: "Somewhere in Time"
              isbn: "9876543210300"
              language: "English"
              characters: "Meaghan Beier, Booboo Mascio"
              settings: "New York, USA"
              litawards: "The Big Apple Award 2019"
              coverurl: "https://s3.amazonaws.com/uifaces/faces/twitter/dhilipsiva/128.jpg"